#pragma once
#include "../../SceneAll/GameObject.h"


/////////////////////////////////////////////////////////////////////////////////////////
// 
// csvからのマップチップ、当たり判定の読み取り
//
/////////////////////////////////////////////////////////////////////////////////////////


class Wind
{

private:

	//-----------------------------------enumクラス-----------------------------------//
	enum class eWindState
	{
		Blowing,
		Stopped
	};

	//--------------------------------------------------------------------------------//

public:

	//--------------------------コンストラクタ、デストラクタ--------------------------//

	Wind();

	//--------------------------------------------------------------------------------//

private:

	//-----------------------------------メンバ変数-----------------------------------//

	// 風が吹く時間
	const float BLOWING_TIME = 2.0f;				
	// 風が止む時間
	const float STOPPED_TIME = 10.0f;				

	// 風の方向
	int m_direction;								
	
	// 風の強さ
	float m_wind_strength = 2.0f;					
	// 経過時間
	float m_elapsed_time;									
	
	// 風の状態
	eWindState s_wind_state= eWindState::Stopped;	

	//-------------------------------------------------------------------------------//

public:

	//----------------------------------メンバ関数----------------------------------//

	void Update(float delta_time);

	//-------------------------------------------------------------------------------//


	//---------------------------------Setter&Getter---------------------------------//
	
	// 風の方向の取得
	int GetDirection() const { return m_direction; }
	// 風の強さの取得
	float GetWindStrength() const { return m_wind_strength; }

	//------------------------------------------------------------------------------//
};