#pragma once
#include "../../../engine/GameEngine.h"


class Player;
class Map;


/////////////////////////////////////////////////////////////////////////////////////////
// 
// プレイヤー追従カメラ
// 
/////////////////////////////////////////////////////////////////////////////////////////


class Camera
{

private:

	//-----------------------------------メンバ変数-----------------------------------//

	// 追従ターゲット（初期値は０）
	tnl::Vector3 m_target = { 0, 0, 0 };			
	// カメラスクロール軌道
	bool m_is_scroll = false;						

	//---------------------------------------------------------------------------------//


	//-----------------------------------メンバ関数-----------------------------------//
	
	// カメラスクロール
	// arg1 ... プレイヤーのポインタ
	// arg2 ... マップのポインタ
	// tips1 ... Update関数内で呼び出します
	// tips2 ... MoveRange関数より先に呼び出します
	void Scroll(Player* player, Map* map);
	// カメラ移動範囲
	// arg1 ... プレイヤーのポインタ
	// arg2 ... マップのポインタ
	// tips1 ... Update関数内で呼び出します
	// tips2 ... Scroll関数より後に呼び出します
	void MoveRange(Player* player, Map* map);		
		
public:

	void Update(float delta_time, Player* player, Map* map);

	//---------------------------------------------------------------------------------//


	//----------------------------------Setter&Getter----------------------------------//

	tnl::Vector3 GetTarget() const { return m_target; }

	//---------------------------------------------------------------------------------//
};

