#pragma once
#include "../../../engine/GameEngine.h"
#include "../../SceneAll/GameObject.h"

class Camera;


/////////////////////////////////////////////////////////////////////////////////////////
// 
//背景クラス（各ステージに応じた画像を読み取り、描画）
//
/////////////////////////////////////////////////////////////////////////////////////////


class BackGround : public GameObject
{

public:

	//--------------------------コンストラクタ、デストラクタ--------------------------//

	BackGround();

	virtual ~BackGround() {}

	//---------------------------------------------------------------------------------//

private:

	//-----------------------------------メンバ変数-----------------------------------//

	// 背景画像のハンドル
	int m_stage_hdl = 0;
	// スクロールスピード
	float m_scroll_speed = 0.05f;

	//-------------------------------------------------------------------------------//

public:

	//----------------------------------メンバ関数----------------------------------//

	// 背景画像のハンドルをセット
	// arg... : 背景画像のパス
	// tips ... Mapクラスから入手し、現在のステージ情報に応じた画像を読み込みます
	void SetBackground(const std::string& backgroundPath);

	void Draw(float delta_time, const Camera* camera) override;

	//-------------------------------------------------------------------------------//
};
