#pragma once
#include <string>
#include "../engine/GameEngine.h"

/////////////////////////////////////////////////////////////////////////////////////////
// 
// csvファイルからアニメーションデータを読み込み、ファイル操作にて画像ロードを行う
//
/////////////////////////////////////////////////////////////////////////////////////////

namespace wta 
{
    // csv記入の各種データを格納する構造体
    struct CsvAnimData 
    {
        //-----------------------------------メンバ変数-----------------------------------//
        
        // アニメーションのデータID
        int s_id;
        // アニメーションの向き
        int s_direction;
        // アニメーションのループフラグ
        bool s_loop;
        // アニメーションの種別名
        std::string s_object_name;
        // アニメーションの発生するアクション
        std::string s_action;
        // アニメーション毎に振り分けたファイル名
        std::string s_file_name;
        // 画像ハンドルIDを格納
        std::vector<int> s_anim_hdl;          
        
        //--------------------------------------------------------------------------------//


        //-----------------------------------メンバ関数-----------------------------------//
       
        // 画像ファイルの検索を行う
        // arg... 画像のフォルダ名
        // tips... 画像のファイル場所、該当アニメーションの各種ファイル名を記入してください
        // ex ... player/idle_right
        void LoadImages(const std::string& basePath);           

        //--------------------------------------------------------------------------------//
    };

    // csvファイルからプレイヤーのアニメーションデータを読み込む
    // arg1... csvファイルのパス
    // arg2... 画像のフォルダ名
    // return... アニメーションデータ
    // tips... AnimLoadのcsvファイルにて、形式にしたがって記入してください
    std::vector<CsvAnimData> LoadAnimationData(const std::string& csvPath, const std::string& basePath);   
}
